tap 'caskroom/cask'
  brew 'composer'
  brew 'elixir'
  brew 'erlang'
  brew 'git'
  brew 'go'
  brew 'hugo'
  brew 'mysql'
  brew 'node'
  brew 'nvm'
  brew 'php'
  brew 'postgresql'
  brew 'pyenv'
  brew 'python'
  brew 'rbenv'
  brew 'rbenv-default-gems'
  brew 'rbenv-gemset'
  brew 'redis'
  brew 'ruby-build'
  brew 'vim'

  cask 'alfred'
  cask 'android-file-transfer'
  cask 'android-platform-tools'
  cask 'appcleaner'
  cask 'authy'
  cask 'bettertouchtool'
  cask 'brave-browser'
  cask 'docker'
  cask 'firefox'
  cask 'google-backup-and-sync'
  cask 'iterm2'
  cask 'java'
  cask 'keepingyouawake'
  cask 'keeweb'
  cask 'keka'
  cask 'kekadefaultapp'
  cask 'malwarebytes'
  cask 'microsoft-excel'
  cask 'microsoft-powerpoint'
  cask 'microsoft-word'
  cask 'postico'
  cask 'postman'
  cask 'protonvpn'
  cask 'rectangle'
  cask 'sequel-pro'
  cask 'spotify'
  cask 'sublime-text'
  cask 'transmission'
  cask 'transmit'
  cask 'tunnelblick'
  cask 'visual-studio-code'
  cask 'vlc'
