tap 'caskroom/cask'

brew 'mas'
brew 'qlcolorcode'
brew 'qlstephen'
brew 'qlmarkdown'
brew 'quicklook-json'
brew 'qlprettypatch'
brew 'quicklook-csv'
brew 'betterzipql'
brew 'webpquicklook'
brew 'suspicious-package'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'fzf'
brew 'ack'
brew 'git'
brew 'vim'
brew 'pyenv'
brew 'mysql'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'node'
brew 'golang'
brew 'heroku-toolbelt'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'ghostscript'
brew 'github-markdown-toc'

cask 'alfred'
cask 'appcleaner'
cask 'avira-antivirus'
cask 'google-backup-and-sync'
cask 'bettertouchtool'
cask 'caffeine'
cask 'cheatsheet'
cask 'docker'
cask 'filezilla'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'iterm2'
cask 'lastpass'
cask 'macdown'
cask 'microsoft-office'
cask 'omnifocus'
cask 'recordit'
cask 'sequel-pro'
cask 'skim'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'tomighty'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'vagrant-manager'
cask 'valentina-studio'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

mas 'The Unarchiver', id: 425424353
mas 'LastPass: Password Manager and Secure Vault', id: 926036361